{"Reviews": [{"Author": "Ms. M.", "ReviewID": "gY_f9RK-rQNhWgo9X_9xYA", "Overall": "4.0", "Content": "It seems like any place that sets up shop right on Bourbon Street is prone to people calling it crap whether it's justified or not.Case and point - Court Tavern. It definitely wasn't on my \"Places to Eat\" list before arriving in NOLA, but you know how it goes...you intend to spend an hour or two drinking on Bourbon \"just to get a taste of it before moving on\" and next thing you know it's 4 hours later and you're wasted and starving (sound familiar)?So we came here and ordered a large roast beef po' boy to share. And...and...it was really good. Surprisingly good. The bread was soft and fresh, the beef melted in my mouth and the gravy was nicely seasoned. Try it.", "Date": "2013-06-26", "Author_Location": "Vancouver, Canada"}, {"Author": "Kenny K.", "ReviewID": "L4bXAVw9bjTWJX22WQxqqA", "Overall": "2.0", "Content": "Gave this an extra star because the service was quick and friendly. But really, the food was more or less Alpo. Got a meatball poboy with something they called marinara, but it was some kind of canned fecal matter. My lady friend felt similarly about her roast beef with gravy. My advice is to go anywhere but here.", "Date": "2014-05-09", "Author_Location": "Corvallis, OR"}, {"Author": "B. H.", "ReviewID": "N8Rr8mKz1vYfrbhEtV68EA", "Overall": "1.0", "Content": "I knew once I saw the menu featuring Boar's Head products I wasn't going to get a po boy of any real quality. But I was craving a shrimp po boy and just couldn't find any where else open late at night except the places on Bourbon street catering to the drunk people. So I didn't have high expectations. Then I saw the Shrimp Remoulade Po Boy was cold boiled \"jumbo\" shrimp. I thought ok....maybe a little something different but I really wanted some shrimp. I got it to go, took it to my hotel room. Opened up the plate and found a nice big HAIR IN MY FOOD. Then a piece of shrimp shell. Gross.Gross.Gross.Gross.Way too expensive in the end, and for the price I would have expected some kind of chips better than Lay's.This is like a deli in a grocery store with worse hygiene.Seriously, these are only po boys to drunk people who are so blitzed out of their minds they can't tell up from down. But hey...that's most of their clientele!!Skip this place...", "Date": "2014-06-02", "Author_Location": "Birmingham, AL"}, {"Author": "Charles H.", "ReviewID": "ysBKXpTKuB_Mh-ci1uXA0w", "Overall": "1.0", "Content": "WORST PO'BOYS in the Quarter: skimpy, dry and outrageously overpriced;UNWELCOMING mess hall dining area;CHARGES TO DRESS? 25 cents to add lettuce and tomatoes!! 75 cents cheese!!There is no reason, even being drunk off yer butt, to eat here.WAY BETTER FQ PO'BOY OPTIONS: Quarter Grocery, Killer Po'Boys, Verti Marte, Nellie Deli, Jimmy John's...Subway", "Date": "2013-07-21", "Author_Location": "New Orleans, LA"}, {"Author": "Steve A.", "ReviewID": "2HEUdJnpSFCfmAJaHKDW2w", "Overall": "3.0", "Content": "As people have mentioned, this is a small hole in the wall on Bourbon that serves up quick good food with a smi....wait, it just serves up quick good food, lol!  We both got a po'boy (Me a fried shrimp po'boy and the gf got a pulled pork one)...all I can say is, YUM!  Ordering was a breeze and the food came right out.  We also tried their \"NOLA Blonde\" home-brew which was actually really good!Not a bad place if you want to pop in and grab a quick bite to eat/drink, and although the guy who took our order was cool and upbeat, but don't expect any real 'service' as you get up and get your own food and definitely don't expect a smile from the cooking staff--I felt like I was going to get beaten anytime I thought about going up to ask for something lol.", "Date": "2013-03-26", "Author_Location": "San Jose, CA"}, {"Author": "Ted C.", "ReviewID": "bSpJEIFPhlEuzLclAH-YcQ", "Overall": "3.0", "Content": "They do a brisk business selling to drunk folks from 11pm-5am. The day time it's not so crowded. There really is no reason it shouldn't be packed either way. The hot sausage po'boy is good, a little greasy but definitely worth price, and it even comes with chips, which is not like many other places selling po'boys around the area. The menu is almost all po'boy along with some other New Orleans staples. What I like about this place is that the food is made right there but it takes so little time to get. The staff is pretty helpful, counter service is obviously not all the labor intensive but still friendly-especially since I meant one thing but said another and it was changed with no fuss. It's a nice change from the pizza places on Bourbon and definitely a good po'boy place.", "Date": "2009-01-06", "Author_Location": "Astoria, Queens, NY"}, {"Author": "Bruce R.", "ReviewID": "AkB97gN2k4erbaa8KOl9fg", "Overall": "1.0", "Content": "I rarely give 1's as I prefer to follow the, \"If you can's say something nice . . .\" way of life. Not this time.One start because, if you are really, really, really drunk it might taste okay? Bleh.And salt to the culinary wound is that this is also WAY overpriced. So many other options even on Bourbon Street.", "Date": "2012-02-26", "Author_Location": "San Francisco, CA"}, {"Author": "Sara M.", "ReviewID": "NqSiEJ3OxrS1vAAT7Rua0w", "Overall": "3.0", "Content": "The po boys are mediocre the gumbo is awesome.  My whole family ate there on Sunday.  The food was hot and fresh,  the service was pretty good.  Overall not bad.  Of course,  I'm a local.  Try the chicken and andouille gumbo with lemonade.  Yum", "Date": "2013-08-08", "Author_Location": "Norco, LA"}, {"Author": "Michael K.", "ReviewID": "-H40I743AHG1irs5PCaC-A", "Overall": "1.0", "Content": "Unclean, understaffed, disorganized, and terribly slow ... plus the food looks like it was purchased secondhand from a prison.  Avoid unless you have a fetish for disappointment.", "Date": "2013-11-09", "Author_Location": "Philadelphia, PA"}, {"Author": "Robert H.", "ReviewID": "fOHJtTAml6A5j4tOVwTJOw", "Overall": "3.0", "Content": "The smell of Southern food was in the air and I popped into the first place that sold jambalaya. Court Tavern is a medium sized hole-in-the-wall place that probably makes most of it's money serving to drunks. You can tell by the fast service and mediocre quality that most people probably don't critique the food much.- Hole in the wall style- Open kitchen- Fast service- Tasty food, better with beer- Don't expect more than a full belly and satisfied taste buds.Everyone does their jambalaya different and here they offer it with a spicy sausage and soaked rice with chicken mixed and bread on the side. You can get all of this for under $10 and it's serves in a Styrofoam bowl. Classy? Not really. If you wanted classy you'd be sitting at Acme, not here. Fast? Heck yes, and that's the reason I came here, for a quick bite.I didn't expect much for quality but the Jambalaya was pretty good. I don't know if I would go out of my way to eat here, but would be back if ever in the area again.", "Date": "2012-02-20", "Author_Location": "Augusta, GA"}, {"Author": "Aaron W.", "ReviewID": "NaFQzWoHIwPrOZpHcaKg1A", "Overall": "4.0", "Content": "I don't get the hate. It's not the best I've had, but it certainly wasn't bad. Yes, it was a little overpriced, and yes the guy taking the order was short and gruff, but it's ~on~ Bourbon. We didn't feel like walking over to Royal. Simple po'boy. And the people watching was almost worth the premium alone.", "Date": "2013-09-01", "Author_Location": "Oak Lawn, Dallas, TX"}, {"Author": "Meg B.", "ReviewID": "AT6F_SN1uWjj9whM68rURw", "Overall": "3.0", "Content": "This place hit the spot after a swamp tour and daiquiri to start off the morning . The place is simple . You got your po' boys, gumbo, jambalaya , red beans and rice. The shrimp po' boy was nicely seasoned, grilled ( not fried) shrimp and on a nicely toasted roll. The gumbo , although not gourmet, it was tasty and filling . Service definitely wasn't with a smile but it was prompt. You get what you paid for and I was satisfied with that .", "Date": "2012-11-30", "Author_Location": "Philadelphia, PA"}, {"Author": "Michael O.", "ReviewID": "SwAb_dioIM6sIHq1W_bWUw", "Overall": "1.0", "Content": "Do yourself a favor and run from this place.  The worst excuse for food that I have ever experienced.  I have had better Po'Boy sandwiches from my local grocery store deli.  The red beans and rice were the most bland thing that I have ever eaten.  Guys, salt and pepper are cheap spices...you should try to pick some up.  I took 2 bites of the Roast Beef Po'Boy and 2 bites of the red beans and rice.  After that, they went right into the garbage.We should have known better when there were only 2 people in the place and no line at 7pm.  Lesson learned.", "Date": "2013-08-12", "Author_Location": "Pflugerville, TX"}, {"Author": "Shannon F.", "ReviewID": "BKSK1WWg1-O9_Cg6aPlkYg", "Overall": "4.0", "Content": "What better for a first time encounter with a genuine Roast Beef Po' Boy than this place, I tell you... I mean, it's New Years Eve 2008, wandering down Bourbon St. with my \"Huge Ass Beer\" and needed a bite to eat. Without sounding TOO MUCH like a tourist, I told my buddy \"Hey, let's try the place with the big ass sign that says 'New Orleans Famous Po' Boy Sandwiches'...\" First of all, the menu is just how I like it: SIMPLE. Check the photo I uploaded. You gotta love a sandwich that not only tastes great but you can measure the greatness of it by how many napkins it takes to keep yourself looking presentable after. (it took me a good 7-8 napkins to look like I knew how to eat like a civil human being) I actually had the combo which consisted of a bowl of Sausage Jambalaya &  half Po' Boy (roast beef w/gravy) The Jambalaya was great as well, decent amount of spice, plus a couple dashes of Crystal Hot Sauce never hurt anybody...The business was steady throughout our time there and I noticed it got busier as the night went on...If I'm ever back in N'awlins in my lifetime, this will definitely be one of the places I hit up. Like I said earlier, I thought this was a great introduction to the food in New Orleans...Little did I know that this place was just a preview of what was to come in my dining endeavors the next few days I was to spend in NOLA...", "Date": "2008-01-07", "Author_Location": "Livermore, CA"}, {"Author": "Ki S.", "ReviewID": "fz4vV67V940PPhyGHekSJw", "Overall": "1.0", "Content": "My husband and I  are actually locals and we are both in the service industry..we decide on our day off to walk around bourbon st and get a bite to eat..we decide to eat at the court tavern  because we were in the mood for a sandwich..being we are from up north we grew up on boarshead coldcuts...which boarshead isnt to common here in nola..so we step in to get a bite ..we walk in the 2 gentlemen who were working looked like a clerk and a kitchen staff member.up front near register with their backs turned to us..we werent acknowledged at all while the 2 guys were chatting up a storm...we decided what we wanted to eat..still no acknowledgement...the clerk proceeded top to tell the other guy a story about him wiggling his penis in someones face...when I had enough of his graphic sex story I then cleared my throat very loudly..to have the clerk turnaround for the first time looking startled..he quickly aplologized for telling a vulgar story and having us overhear it....then to top it off..my husband  and I split 1 turkey sandwich(which was quite small and cheesy) 1 soda all for $15..boarshead or not!!! Sandwich tasted ok...but the  staff..ambiance,(tables were sticky and dirty)..service and portions leave alot to be desired...Sorry....quite a disapointment..", "Date": "2012-01-28", "Author_Location": "New Orleans, LA"}, {"Author": "Allen H.", "ReviewID": "mvbv5SyEJixFbMvEovw8dQ", "Overall": "4.0", "Content": "Four words...Red. Beans. And. Rice.  Don't walk past.  Go inside, have a bowl of the best red beans and rice I have ever put in my face.   Sorry Mom.  Don't worry about service, there won't be any.  You go in and eat....that's it.", "Date": "2012-03-19", "Author_Location": "Panama City, FL"}, {"Author": "Amber L.", "ReviewID": "nRIW0ktxY2opjT-isFNtFg", "Overall": "3.0", "Content": "Serves up a decent po-boy... nothing to write home about, though. I bought the bbq pork one, pretty darn good and very filling. I'd like this place better if they had a bathroom. Also, if the employees didn't look and act like they hated their lives.", "Date": "2011-06-04", "Author_Location": "San Jose, CA"}, {"Author": "Lucas L.", "ReviewID": "HNL7KRVft4IgMM8WhPxLNw", "Overall": "2.0", "Content": "Eh, I kept hearing that I HAD to get a Po'boy. I dont think anyone HAS to have one of these. It was good, but it was just a normal sandwich with beef and gravy... nothing special. Pretty much a let down... not to mention I was intoxicated and still wasn't impressed.", "Date": "2011-12-12", "Author_Location": "Albuquerque, NM"}, {"Author": "Vincent M.", "ReviewID": "dmcOiSAB4KBM1CWmEgpFRQ", "Overall": "2.0", "Content": "The service and friendliness of the staff leaves a lot to be desired. Also the jambalaya tasted like it came from a box. If you go to eat there for free, like we did, it is worth it but otherwise no.", "Date": "2012-10-13", "Author_Location": "Gramercy, LA"}, {"Author": "S S.", "ReviewID": "u8ycU6EvOxCI7lQU5gpsgw", "Overall": "1.0", "Content": "This place sucks!!! Expensive, Unfriendly!", "Date": "2012-09-24", "Author_Location": "Anaheim, CA"}, {"Author": "Donya X.", "ReviewID": "8ZskgcfMfLrF-YDltL_WPg", "Overall": "2.0", "Content": "We were looking for a good po'boy for lunch. I ordered the shrimp boy with a side of jambalaya. DH had the spicy sausage with a side of jambalaya, I enjoyed the shrimp po'boy, sauce was nice and spicy however I expected the shrimp to be fried instead of grilled. The bread they use is very crusty meaning you take a bite and you have crumbs on your clothes and the table. DH enjoyed the spicy sausage. The jambalaya has a lot to be desired, we found it very dry, undercooked and lacking of any real taste. Very disappointing. Guess we expected more for less than $11.00 a person.", "Date": "2009-01-19", "Author_Location": "Flat Lake"}, {"Author": "sarah c.", "ReviewID": "b4_9PYuqP6qyjHwLSeW5QA", "Overall": "3.0", "Content": "Muffeletta sandwich was good but too greesey.", "Date": "2011-08-01", "Author_Location": "Newark, CA"}, {"Author": "Dave L.", "ReviewID": "Iu6Pq7ldmOo1uAgpfTcGqg", "Overall": "2.0", "Content": "A friend from Baton Rouge recommended that I go to the Court of Two Sisters.  Well, one look inside and its white table cloths were not quite what I was looking for for lunch.  But, next door was the Court Tavern touting world famous Po Boys.  The Court Tavern is owned by the same people so I gave it a whirl.  Whenever I travel I simply tell the waiter that I have never been here before and let her order for me.  She gave me the Roast Beef Po Boy \"dressed\" with lettuce, tomatoes, pickles, and swiss cheese.  The french bread was average, the roast beef was average and the gravy the meat was drenched in really lacked a definitive taste, but it was above averagely messy.  Oh ya, and it came with a bag of average Lay's potato chips.  If you are looking for a good bland meal at 2 AM to soak up some alcohol--this is your place--conveninetly located on Bourbon Street.  If not, skip the Court Tavern", "Date": "2011-02-09", "Author_Location": "Modesto, CA"}], "RestaurantInfo": {"RestaurantID": "g254XzWzS_4Fzk8qB1VJ_Q", "Name": "Court Tavern", "Price": "$$", "RestaurantURL": "/biz/court-tavern-new-orleans-2", "Longitude": " -90.06609749999999", "Address": "612-614 Bourbon StNew Orleans, LA 70130", "Latitude": " 29.9581312", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/niBM7-uDI4SzIeUCdl7Gwg/90s.jpg"}}