{"Reviews": [{"Author": "Alberto S.", "ReviewID": "RL6WQYWX5LJiPInOEuK1pg", "Overall": "5.0", "Content": "Great Coffee!Great Food!Great Ambiance!Best chocolate chip cookie I've ever had", "Date": "2014-07-08", "Author_Location": "Houston, TX"}, {"Author": "Antelmo M.", "ReviewID": "9FQocCCuUysb8CDWKDoajA", "Overall": "3.0", "Content": "Siphon for one = $7 Siphon for two = $11Tried the siphoned coffee just for kicks, the presentation is cool but probably not worth the cost (it also takes awhile, I can only imagine how it must get when it's crowded). It did feel a bit cleaner, but other than that nothing really special. I think drip coffee is just as good, so I would def. save my money next time and go with drip or other espresso drinks. The parking is ample and I went on a Saturday eve with friends so there was plenty of seating. I would probably go back again ONLY if I was in the area and needed a fresh cup.", "Date": "2014-07-07", "Author_Location": "Houston, TX"}, {"Author": "Ji Hyun Y.", "ReviewID": "PQz505IfTB7V6QxdP0nksg", "Overall": "3.0", "Content": "So....I came here after a birthday dinner for a friend to see him cut the cake and all so there was not much to try. Although I did order a iced caramel latte from there which tasted a bit too sweet. I heard from my other friends who were with me at the time who also ordered drip coffee or otherwise known as the siphon process? to taste a bit too bland for their taste. Anywhoo, I guess this place isn't much a coffee shop (with their coffee tasting so-so) but rather a sandwich shop cause I noticed more sandwiches on the menu both online and in store AND they were featured on some newspaper and other medias on where to eat and stuff.", "Date": "2014-07-05", "Author_Location": "Houston, TX"}, {"Author": "Sam W.", "ReviewID": "5c9-cDC71bxkntr1ImLNrQ", "Overall": "4.0", "Content": "This is a neat place...I like that they also have wine so there tends to be something for everyone, but I found that place to be kind of small and it was cramped. It is a very interesting modern space and the service was friendly...it is definitely a place to check out...I am sure I will be back here from time to time.", "Date": "2014-07-16", "Author_Location": "Houston, TX"}, {"Author": "Amy T.", "ReviewID": "ug1PA-BMCsqavKLMiqMJiQ", "Overall": "3.0", "Content": "One of those places where the ambiance beats the coffee.  Yikes.With so many coffee shops to explore in the Houston area, this one is worth skipping.  The coffee just doesn't do anything for me, in fact, it tasted a bit watered down.  It's a shame because they have all these fancy coffee devices.  Maybe I need to come back and give them another shot, maybe I have spoken too soon.  who knows.", "Date": "2014-07-05", "Author_Location": "Dallas, TX"}, {"Author": "Stephanie M.", "ReviewID": "4aVHtI4qas7v6eB3mDxQnQ", "Overall": "3.0", "Content": "3 stars for selection. But it's slow. Be prepared to wait longer than usual. Waiting 10-15 minutes for a cold press is extremely long considering it's premade. Most likely won't come back.", "Date": "2014-07-13", "Author_Location": "Houston, TX"}, {"Author": "Dana L.", "ReviewID": "qNPsP4o5O0Qf_ai7PNTN3g", "Overall": "5.0", "Content": "Great salad and panini choices. A bonus for me is they have wine on tap! Great atmosphere. Next time will try coffee and breakfast.", "Date": "2014-07-12", "Author_Location": "Houston, TX"}, {"Author": "Brandon A.", "ReviewID": "1Xbbga9SQEP2rsYjNYYhMQ", "Overall": "3.0", "Content": "Great atmosphere, subpar espresso. Friendly staff who were helpful and accommodating but the cappuccino was just not up to the standard of so many other local coffee places. Willing to give it another shot.", "Date": "2014-07-14", "Author_Location": "Richmond, TX"}, {"Author": "scott t.", "ReviewID": "3CPBZPdYdN_AqVsst4bBwA", "Overall": "3.0", "Content": "Cool place, great decor. Very nice atmosphere to chill and lounge around. It's just expensive. Tried the siphon, it was average, I wouldn't pay $11 for it again. I'll stick with the latte.  Food menu is also expensive :( Had a panini and it just wasn't worth it. Just wished the place was more affordable.", "Date": "2014-06-23", "Author_Location": "Houston, TX"}, {"Author": "Patricia S.", "ReviewID": "L1ooKYxajXLVZXPwb_36xQ", "Overall": "4.0", "Content": "Pretty great so far. They use Amaya Coffee beans which I (gasp!) prefer to Greenway. I've been three times now and on each visit, my drink was perf. The siphon coffee tasted very clean and smooth.  I like the interior's layout and there is plenty of seating, inside and out. However,  you're out of luck if you don't manage to get a seat at one of those comfy leather chairs or the long bench along the back wall. The stools they use were really uncomfortable for myself and everyone in our party of 4. Maybe it's a clever way to keep people from lingering there too long.I've tried a few of their pastries but I'm mostly into their beef empanadas. I will always choose something savory over a sweet in the morning. I hope they always have those available.All in all, a pretty winsome place.", "Date": "2014-06-18", "Author_Location": "Houston, TX"}, {"Author": "Captain A.", "ReviewID": "-0ReHq42Z8A3rjMRWMjGyQ", "Overall": "4.0", "Content": "The drip coffee is good. I didn't have the nerve to blow a wad of cash on their siphoned stuff. I'm sure it's great or whatever.Their peach muffin is outstanding.They don't jack up the music at all and I love that. It means that people don't have to talk as loud in the admittedly not-acoustically friendly bare wall and ceiling room. The parking is relatively very ample, although I think that will change once other businesses open in the little strip center that this place is located in. I dislike having to park in front of houses nearby because towing is always a sudden threat when residents one day get fed up. So far it's safe.My biggest gripe about the place is that they have a bunch of food items posted on their blackboard, but no prices. Just put the prices up.", "Date": "2014-06-21", "Author_Location": "Houston, TX"}, {"Author": "Lara W.", "ReviewID": "hReFBCsH-0aW0iJ9JgnG9Q", "Overall": "1.0", "Content": "1 latte 12oz1 black coffee 12oz2 potato tacos$18.23Latte - I've had better coffee-like beverages come out of the automatic machines you find at your local gas station. It honestly tasted like water-downed milk with some sugar in. Regular Coffee - It wasn't my beverage but I was told it was right up there with instant coffee. Tacos - Oh so greasy. The tortillas were transparent. Wait Staff - Rude, scantily dressed and unprofessional.  I get that it's just a coffee shop but come on now have some pride in your appearance.  Never again. I'll drive the extra few minutes to Inversion.", "Date": "2014-07-04", "Author_Location": "Houston, TX"}, {"Author": "Miche L.", "ReviewID": "7nj-runzXyJxBt6najPfJw", "Overall": "1.0", "Content": "Went the weekend after they opened and I ordered a hot latte with almond milk. They told me it would be a few minutes and after visiting with a friend I realized it had been 45 MINUTES and still no latte. I went to ask about it and they seemed to have forgotten, they then said the machine wasn't working? The worker asked if I wanted it cold. I took what I could get- which turned out to be a cold latte with regular milk. -_- I think the inefficiencies were due to lack of coordination among staff after just opening but jeeze! Won't be going back anytime soon. Hopefully they have it more together now!", "Date": "2014-06-21", "Author_Location": "Houston, TX"}, {"Author": "Marc d.", "ReviewID": "pzCBzy6r4s3ACSte0vkViQ", "Overall": "5.0", "Content": "My new favorite coffee shop in Houston!  This place knows its coffee, thanks to some veteran baristas who have honed their skills in other fine coffee shops in town. You know it's a good place when you see baristas from other coffee shops just hanging out.  I have been coming here for a couple of weeks now and I must say that apart from the expertly pulled espresso, they serve some pretty good eats as well. Their empanadas are very good, esp with the homemade chimichurri sauce. Though the tacos are about twice the average price from local taquerias, they are still pretty darn good and I order them in the morning when I'm there. The ambiance is perfect for coffee house lovers, to just sit and do whatever it is that coffee house lovers like to do.", "Date": "2014-06-15", "Author_Location": "Houston, TX"}, {"Author": "Joe I.", "ReviewID": "TW50rSJHSNZIcrnchPiDEQ", "Overall": "2.0", "Content": "Pros:- 2 blocks from my house- Design/interior and lounge areas- Good coffeeCons:- Awful food (greasy, bland breakfast tacos, boring panini with lays chips on the side, cookie actually decent)- generally pricey menu except latte menu- service is pretty erratic, frequently blamed on the ticket printer, on at least 3 visits they have lost my order- VERY LOUD!!! HAVE TO YELL TO COMMINICATE- wifi is extremely difficult to use, I had to ask 3 times and finally the person next to me  said she was able 'figure it out' and showed meOverall:You're gonna have to step it up siphon, because if you are missing the #1 Pro, this place isn't really worth it", "Date": "2014-06-25", "Author_Location": "Houston, TX"}, {"Author": "Drew K.", "ReviewID": "B0AzhEPWENImfNvnQNg61g", "Overall": "4.0", "Content": "As someone who lives a few blocks away, I'm a fan! I was excited enough to see Montrose Mercantile open up one direction down my street and then Siphon popped up the other direction! Now we've got more hipster coffee shop options than I can shake a stick at!  Big plus above Montrose Mercantile is that they offer hot food on top of well done coffee, espresso, etc. Price point is a little high for their cafe style food options (panini press, egg in a hole, etc) but as I slowly make my way down the menu of artisinal sandwiches I can see there's a good amount of care put into each plate. I'm lost on their hours. Their soft opening was restrictive, but they then said they were open until 10 on weekdays then midnight Friday and Saturday night. I drive by and didn't see them open that late, so hopefully they get the newness ironed out. If you like quiet coffee shops where you can curl up take a sip and take in the calm and caffeine, go to Montrose Mercantile down the street. If you like more bustly coffee shops (or siphon coffee specifically) that also offers food, go to Siphon. Either direction I win.", "Date": "2014-06-11", "Author_Location": "Houston, TX"}, {"Author": "Raffi M.", "ReviewID": "FPSERpTIdrMKVL8b2qQzyg", "Overall": "4.0", "Content": "The siphon process produces really terrific stuff.  Sure, it's really expensive at $11 for two, but it really preserves some of the subtleties of the coffee in a way that espresso and French press do not.  Like others say, the siphon coffee takes time.  When they're backed up, the usual 10-15 minutes might well stretch.   Even so, I think it's worth it. The food is fine.  We had some pricey breakfast tacos.  But you're here for the coffee - no?", "Date": "2014-06-12", "Author_Location": "Houston, TX"}, {"Author": "Erin W.", "ReviewID": "7XT8KweZ4NMoZDpjqJpfgg", "Overall": "4.0", "Content": "I just had a basic latte--but it's incredible what a difference there was in the flavor of the coffee. Nice selection of freshly baked goods and menu items. It is almost 10 am on a Tuesday and there were plenty of people there, but it was quiet. Perfect place to come to study or get some work done. Plenty of parking for now. I will definitely be back!", "Date": "2014-07-08", "Author_Location": "Upper Kirby, Houston, TX"}, {"Author": "Monique P.", "ReviewID": "vH4u-yRd3JBmSvjh7QcMTA", "Overall": "5.0", "Content": "This place is Awesommmmmeee!  Even when I passed by it months ago (when it was still under construction) I had a good feeling about this place. Siphon Coffee has all the workings of a great coffee shop, but without the pretentious attitude. We came here twice before, only to be sadly turned down because they closed early during their soft opening. The second time we came the owner (I think) apologized and thanked us for making the journey to the coffee shop. Finally, their regular hours started this week and  my friends and I could finally try this place.  We ordered the siphon coffee for two, a blondie brownie, a sea salt chocolate chip cookie, and a cheese and meat plate.  The coffee was really fragrant  and delicious. You can tell that the staff knows their coffee. We got the suggestion to let the coffee \"breathe\" for a little bit before consuming. I added a little bit of sugar and milk to my coffee- I don't think it took the flavor of the coffee away at all. The cookie was a little burnt around the edges but still had a pretty good texture, and a good chocolate chip to cookie batter ratio. The blondie was my favorite, sweet, good texture, and a hint of salt. The cheese and meat plate was one of the best I've had. We got a selection of brie (very mellow flavored), Gruyere (so creamy) and blue cheese. We also got prosciutto, salami, and another cured meat that I don't remember what the name was.. we also got pickles, mustard (really good mustard), mixed nuts, and quince jelly. The entire plate came with three long slices of toast, and we could break the toast and put a multitude of toppings to our liking. All of the components of the board complimented each other so there wasn't a wrong combination. I had a toast with mustard, brie and salami. One with gruyere and proscuitto, one with brie and quince jelly, and so on. I definitely recommend this cheese plate - perhaps with a glass of wine than a coffee. Staff was really friendly and accommodating. I felt very welcome. Thanks for a great first visit Siphon! It won't be my last! Worth the wait. :)", "Date": "2014-06-04", "Author_Location": "Houston, TX"}, {"Author": "Amy D.", "ReviewID": "MC_oHJ19iSa05on8A8lKzA", "Overall": "5.0", "Content": "I am pretty picky about cold brew coffees and Siphon Coffee knows how to do it right. I was not impressed with coffee shop near my AirBNB during my stay in Houston and saw Siphon Coffee opened a mile down the road. This is a brand spanking new coffee shop with nice open modern feel. The decor is exposed wood and handsome leather chairs. The flow of the coffee shop works perfectly preventing a cluster you know what that happens at some places.While the cool siphon coffee and its fancy contraption is the star of the show, it is much more than just a coffee shop. They also pour beer and wine on tap and have a decent food menu with items to pair well with all of their drinks (coffee, tea, wine or beer). Display cases at the front counter had savory empanadas and various cheeses.I was unable to try the siphon coffee (it takes several minutes to prepare and meant to drink immediately after).  I did order Jesse a coffee and myself a cold brew and Topo Chico to go. Service was friendly and the touch screen checkout was quick and efficient.They also have outdoor seating but forgot to ask if they are pet friendly.", "Date": "2014-05-26", "Author_Location": "Austin, TX"}, {"Author": "Karen G.", "ReviewID": "U1LowVTFAL4xl7BTBrSmog", "Overall": "4.0", "Content": "1) Their espresso beans are sourced from Amaya Roasting Company. 2) They don't charge extra for soy. Those two factors alone make Siphon Coffee stand out from most other coffee shops in the area. What makes this place even better is its no-frill, urban appeal. It doesn't try to make the place more hip/artsy/Montrose-y (if you know what I mean)/trendy with its decor. The streamlined set-up consists of furniture of dark-wood tables, leather accent chairs, communal coffee tables and a small side nook with a sofa for lounging with a larger group of friends. Despite the abundance of windows, the openness and the dark interior palette, the place still felt cozy. Need to go back to try their siphoned coffee (was in a hurry) and try out their food, which they noted were all made in-house. Also it's important to note that they only offer natural sugar options. I find that if you want to serve quality coffee, then you should offer quality condiments - none of that Splenda poison you find at other Montrose coffee shops. **Returned 5 days later and realized that the acoustics of the place is awful. I could hear everybody's conversation, plus the bad rock video the guy in the other table was watching on YouTube. Knocked down a star. **", "Date": "2014-06-11", "Author_Location": "Houston, TX"}, {"Author": "Babak Bobby Y.", "ReviewID": "kmCLkQ4p5a5vj2Jzuh4Wkg", "Overall": "4.0", "Content": "Siphon coffee is awesome! Order it black and taste the smoothest coffee in Houston. Expect to wait 7-15 minutes for the temperature : pressure difference in the brewing process to create your perfect cup of coffee and enjoy a sea salt chocolate chip cookie or snack on a chicken empanada while you wait. Free wifi included.", "Date": "2014-06-08", "Author_Location": "Houston, TX"}, {"Author": "J L.", "ReviewID": "3ow5oEQ1l-WWQZEtSCwz2Q", "Overall": "5.0", "Content": "Latte is unbelievable and the baked goods are made all in house.   Everything I have tried is amazing.   I look forward to coming here again and again.  Great job guys!!", "Date": "2014-07-08", "Author_Location": "Houston, TX"}, {"Author": "Kat W.", "ReviewID": "LFUw9hdrwr9oEUn5WcH79A", "Overall": "5.0", "Content": "Because I live just a few blocks away, I've been eagerly awaiting Siphon's opening since the sign went up months ago - driving past in the morning, peering through the windows when I'm out walking at night. Clearly I'm not the only one, because the parking lot has been packed every day this week!I biked over this morning for breakfast, caffeine and laptop time. The interior was beautifully designed. The line was long-ish - maybe 10 people at its peak - and well-deserved. The coffee was great. I just had the drip, no siphon, and it had a nice fruity flavor. Even better was the tortilla espanola topped with goat cheese and the beef empanada with perfectly flaky crust and perfectly flavorful chimichurri. I regret not topping it all off with one of their chocolate chip cookies, which were enormous and appeared to be more chocolate than cookie. Hold on, cookie... I'm coming back for you. My laptop and I will be back when the crowds die down (or, let's face it, sooner). I hope a bike rack is coming soon.", "Date": "2014-06-01", "Author_Location": "Houston, TX"}, {"Author": "Marci J.", "ReviewID": "JCTMruiVAr6SF1_MSq43vA", "Overall": "5.0", "Content": "Fantástico! I have been anxiously awaiting the opening of this new coffee house, and I must say that I am tremendously impressed!  It is very hip, open & spacious.They serve breakfast until 11:00am, I must say their version of the Croque Madame, the Croque Madame in a Hole is phenomenal. It looks a bit scary when you see this huge sandwich made of very large oversized bread; however, it is overflowing with delicious hunks of ham, gooey gruyere & covered with a béchamel with a peppery bite then topped with an utterly perfect poached egg.  DEVINE!Now on to the coffee: they offer Amaya coffee, the Cataline guy is here today helping out. I ordered my famous Cortado which was smooth, not too strong, but very flavorful and perfectly done. I also ordered an Iced Vanilla Caramel Latte which is perfectly sweet without overpowering the flavor of the coffee and is also very smooth.  Other breakfast offerings include a daily quiche, empanadas, yogurt, Texas Benedict and various assortment if pastries.  I hear they offer paninis for lunch time, have lite bites & also have beer & wine on tap.I will definitely be returning here again!", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "Tony A.", "ReviewID": "fiZR4zWokWuDgyylyhKeXQ", "Overall": "3.0", "Content": "Let me start off by saying that I've only tried a limited selection of the food/coffee offered by siphon in my 3 visits. The coffee is consistently good and the lattes/expresso is outstanding. I believe they use whole milk in their lattes which result in a very rich and creamy beverage. Drink prices are consistent with others in the area, except for the \"siphoned\" coffee which is produced using exotic means. $7/little beaker (maybe 1.5 cups) is stupid expensive and tasted like normal coffee. The food I've tried (breakfast tacos/salumi) is below average and way overpriced. The tacos weren't seasoned, generally bland, and small ($3 each! Not sure if they understand their competitors). The salami was also lacking in flavor. Overall I'd highly recommend coming to grab delicious drinks but avoid the food.", "Date": "2014-06-21", "Author_Location": "Houston, TX"}, {"Author": "Aubrey H.", "ReviewID": "NYyGVo2i3-vy7Wy_-L_yiQ", "Overall": "5.0", "Content": "I've tried all the local almond milk lattes...this surpasses them all! Yum so smooth, creamy, and sweet (no sweetener added)! New place to get my caffeine dosage, for sure!", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "James W.", "ReviewID": "NspItBrZ4OUQ2uYfyGPEyA", "Overall": "5.0", "Content": "Me like it a lawt. Yogurts with mango. Cawfee things to bevere. Other goods per mangiare. Loads of glass and a suhweet hidden patio!Watch the siphon magic! Be careful to not burn your tongue! Wear clean clothes! Don't shoot the piano player!It definitely bears a second visit (rawr)- as long as the empanadas are a part of, at least one visit. Oh, make sure to smile at people whilst visiting.", "Date": "2014-07-04", "Author_Location": "Upper Kirby, Houston, TX"}, {"Author": "Jonathan J.", "ReviewID": "Xjc6v0pAM2wCnJ2rItB-mw", "Overall": "5.0", "Content": "My girl friend and I live very close to siphon so we decided to check it out. We heard about the namesake drink that the place is named for and decided to get one of those. It was fantastic! It was fun to watch being made and interesting to pour and delicious to drink. There food is fantastic as well! I had two breakfast tacos, one sausage and the other chorizo. I love how tightly wrapped they were and the tortilla was very sweet. The other dish that we ordered was the croque Madame in a hole, was really really good! My friend ordered the eggs Benedict and he said it was great, and it looked it too! Eggs were perfectly done. I would recommend this place to everyone, a great new addition to the neighborhood!!", "Date": "2014-06-01", "Author_Location": "Houston, TX"}, {"Author": "Rachel M.", "ReviewID": "eeAwh44AzADDB0Xwt902eg", "Overall": "2.0", "Content": "We waited 30 mins on an $11 siphon for two and banana bread. Because we brought the dog I couldn't really \"watch the process and chat\" which was the reason I was told people kept \"taking\" my siphon. It was the soft opening so of course there will be kinks and they were very apologetic, but that's a little ridiculous. The food options they had were more broad than most Montrose coffee shops, but the wait wasn't worth it at all. Hope they get more efficient.", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "Catherine G.", "ReviewID": "4yPznEMN3JxfJNrxDUtcZw", "Overall": "5.0", "Content": "I really enjoy having Siphon Coffee as my new neighborhood coffee spot! My favorite things about Siphon are their paninis, meat & cheese plate, Pinot Noir, and yummy coffee! I recommend coming in the mornings to grab one of their breakfast tacos. In the afternoon - try a panini! I brought my brother here and we both enjoyed our beef empanadas. So obviously I have gushed about the food but one other thing I am obsessed with is ... the design and layout of the shop. It's very open and you can tell the baristas and cooks have space to work. Unlike other local Houston coffee shops, which are at times incredibly crowded with a lack of space or the same group of people, Siphon brings new light into that area of Montrose! I enjoyed the local artwork and the leather / wooden interior! Clean restrooms (I can speak for the women's) ! The management has treated me with friendly respect every time I have walked in! It's refreshing to see how the owners and partners in the business are there working each time I go in there. It shows dedication!  I think that the only thing that needs improvement is: finding a consistent wifi provider, providing mosquito remover candles outside during the night, and having menu specials!", "Date": "2014-07-08", "Author_Location": "Houston, TX"}, {"Author": "Austin B.", "ReviewID": "-TPNQRUbc5KvOeB70UE2Bw", "Overall": "5.0", "Content": "Pretty great spot if you haven't checked it out yet. I live about a block and a half away so I stop by just about everyday on my way to work, I may just be guilty of stoping by on my way home every now and then too. I am a huge fan of local and small businesses so I am always eager to support places like this every chance I get. The only thing I would like to mention is a little difference in taste between the morning/lunch and the evening crew. I get the same thing every time, the iced dirty chi latte. For some reason it always tastes a little better in the evenings when I am on my way home from work, not that it is ever bad. I'm not sure if this is a recipe or barista issue but it's a slightly noticeable one. Either way, this will not keep me from returning. I look forward to trying some of their edible fare here in the near future too. Everything looks and sounds great.", "Date": "2014-06-26", "Author_Location": "Houston, TX"}, {"Author": "ED W.", "ReviewID": "DJ1JvUbaVB4sBosbyXBfCg", "Overall": "5.0", "Content": "As an avid coffee drinker I have to say SIPHON is the future of coffee shops. In this day and age when people witness the success of a business and think they can duplicate the same success by copying the model usually do not hit the mark. SIPHON however is changing the game. GREAT coffee, gourmet quality food and the process (although old) is unique and entertaining. I wish SIPHON much success and can't wait to support SIPHON throughout Houston and other parts of the country. Mike and Diane you came on the charts NUMBER 1 WITH A BULLITT !", "Date": "2014-05-31", "Author_Location": "Houston, TX"}, {"Author": "David R.", "ReviewID": "uQ99TOh-QRXlGEQwecn-yw", "Overall": "5.0", "Content": "Great coffee and wine,beer", "Date": "2014-06-26", "Author_Location": "Houston, TX"}, {"Author": "Karen S.", "ReviewID": "jO6C4BAYOcCSvfBUvIRJ0g", "Overall": "5.0", "Content": "I happened to be driving by this place and decided to check it out. I had a salad and a siphon and both were delicious. The place was crowded, but the staff coped well for it's first day open. I foresee a bright future for Siphon. I'm going back for a salad in a little bit. Yummy!!! I haven't found a salad this simple yet delicious on Houston. I also loved the chocolate chip cookies with chunks if sea salt. I may skip the sweets today though!", "Date": "2014-05-27", "Author_Location": "Houston, TX"}, {"Author": "Kristen S.", "ReviewID": "SyqYZwC47oEk09C3MiLYMQ", "Overall": "4.0", "Content": "I like the atmosphere, the coffee (they use Amaya locally roasted coffee!) and the service, aside from the usual new place jitters, seems like it will be great once things get going. Definitely a coffee shop to keep an eye on. Bonus: I can walk to it!!!", "Date": "2014-06-14", "Author_Location": "Houston, TX"}, {"Author": "Ashkan R.", "ReviewID": "fOzzj5W5OMvhCog3N00pqw", "Overall": "5.0", "Content": "New cafe in my neighborhood that was much awaited. It is finally open and well worth the wait and anticipation of it's opening. The coffee is excellent and the food is just as good. And the service is on point. Two thumbs up for this new cafe.", "Date": "2014-06-20", "Author_Location": "Richmond, TX"}, {"Author": "Gunes A.", "ReviewID": "icF90_ySEJFivlKevJNRfg", "Overall": "3.0", "Content": "Actually it is a nice place. Nice interior design, helpful staff, decent menu for a coffee place. Yet it is too loud! I mean \"I cannot hear myself thinking\" kind of loud! I was there to do some work. It is impossible to concentrate. I don't think I will ever go again. At least not to study or to read. Maybe to meet with friend ... Actually when I think about it, I don't think it is even possible to hold a conversation with a friend without screaming. So I will not go there again! Oh! And internet connection. Took half an hour to connect", "Date": "2014-06-06", "Author_Location": "Houston, TX"}, {"Author": "Jose G.", "ReviewID": "z0aO1xJeVa05s507rm125w", "Overall": "4.0", "Content": "Not sure what the big deal is. Just a coffee shop. Nothing to separate it from others in the area. It's a blend between a Urban Outfitters (loud music playing in the background,  with hipster crap strewn about) and a Starbucks... Oh and they served food. Not a place to come study or read, and it seems most people are more concerned about being seen \"working\" on their Macs (as they are constantly looking up to see who's watching them) than actually getting work done. Pros -Lots of parking; Lots of chairs for sitting;Lots of windows and natural lighting;Clean restrooms; Fast service; Outdoor sitting area; Long hours; and ...Coffee is passableCons -Pretentious vibe; Too many hipsters; $$ of coffee and I have to blend it myself!!; and Again not for studying or working.First impressions not sold on this place, but would definitely consider coming back for seconds.", "Date": "2014-06-07", "Author_Location": "Houston, TX"}, {"Author": "A T.", "ReviewID": "3RYTbtSssQtgPgkz3ruuxQ", "Overall": "4.0", "Content": "I live a block down the street from this place and have been patiently waiting for it to open since the day they put the sign up. Walking in on a Tuesday morning, I had fingers crossed hoping this place would be good and it definitely delivered. Drinks:I had a skim milk latte and it was delicious with nice foam on top. I wish they would add sugar in the raw and simple syrup to their sugar options. Food: I had the breakfast burrito and at only $2.50 I thought it was a pretty good deal. I got the egg and potato one which came in a homemade tortilla w/ green salsa on the side (always bonus when they have green salsa!). I would have liked some bacon added to it but it wasn't an option. It was a little on the salty side for me but still tasty none the less. I also had the chocolate chip and sea salt cookie. Super delicious and would definitely recommend it! Service was a little slow so be ready to wait if you order food. I wasn't in a hurry so I wasn't bothered by it. The staff seemed super friendly which is always nice. They have beer on tap, wine, and a decent looking lunch/ dinner menu. Would love to come back for a glass of wine and cheese plate.", "Date": "2014-05-27", "Author_Location": "Houston, TX"}, {"Author": "Vivian M.", "ReviewID": "fbTXZPMucboBT7AciqcqSw", "Overall": "4.0", "Content": "Dropped by on a Saturday morning with family to try out the siphon coffee. It was wonderful. So great that I wished we'd ordered more. A large siphon is really only for two ;-(. Smooth and awesome taste. Worth the wait if u can entertain your kiddo with one of their breakfast tacos or pastries. Will definitely make another trip back sometime. Also liked their seating layout as I didn't feel like the chairs were in a jumble and I was going to trip and fall before I got more coordinated from my caffeine fix. Yes, I need coffee that bad.", "Date": "2014-06-09", "Author_Location": "New York, NY"}, {"Author": "Jason K.", "ReviewID": "4bzaRREKjPJUCPJEqHPwpQ", "Overall": "5.0", "Content": "This place is really cool.  You can tell there was a lot of thought that went into the decor and coffee technique - which is really good.  The owner was very nice and concerned about everything being perfect.  Will be back.", "Date": "2014-05-27", "Author_Location": "Houston, TX"}, {"Author": "catalina b.", "ReviewID": "Cp0RwRLDGHK9XEONTFoOLg", "Overall": "5.0", "Content": "Loved this place. They have a great menu and delicious coffee. I had a salad, a panini, and a blondie for dessert and was very impressed. Everything was yummy!! Hadnt had a panini that good in Houston. Will definitely be back!", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "Doris D.", "ReviewID": "1n9omi1cnCByjETIhzBkNQ", "Overall": "3.0", "Content": "Spacious interior and plenty of seating. Chicken empanada is flavorful and tasty with chimicurri sauce. I like that they served our muffin and empanadas warm which most of coffee houses did not practice. Coffee service is a hit or miss at this point since they just opened. It took a while for them to make our coffee even though other patrons behind us already got their coffee. However, the owner I believe apologized for the delay service. We will come back after a few weeks once they work out the kinks.", "Date": "2014-06-01", "Author_Location": "Houston, TX"}, {"Author": "Cynthia G.", "ReviewID": "mJSE6U0oeKIo71NGbE7B1g", "Overall": "3.0", "Content": "I was excited since I saw this place was coming to the Montrose area and finally came in today. The place is decorated nicely, staff seems friendly but I wasn't blown away. The place has a good menu of food and drinks but it's not much different than other coffee places around this area. I was going it would be like Boomtown but sadly is not, it's more of a hipster coffee place for now.", "Date": "2014-06-07", "Author_Location": "Houston, TX"}, {"Author": "Angela J.", "ReviewID": "E1TxuOcefVXsZzpvdskG5A", "Overall": "4.0", "Content": "So far I like this place. Good service and atmosphere. Since this place is new it was clean. I came mid day around 4 and it wasn't too crowded and I had a place to sit. Which could be because it's new. My cappuccino was luke warm, so that was a negative. But in all great experience.", "Date": "2014-06-10", "Author_Location": "Midtown, Houston, TX"}, {"Author": "Marcus M.", "ReviewID": "sMf9hGEI3XMYAu-buTENYA", "Overall": "5.0", "Content": "Really nice addition to the Houston coffee scene. Excellent cold-brewed coffee. Haven't tried the Siphon yet, but I heard it's fantastic. Well-curated beer and wine selection. Deviously enticing pastries. Paninis that are generously stacked and perfectly browned. Yes, you have to be prepared to be patient, but good things come to those that wait!  Decor is spare now, but not unattractive and, if other Houston businesses were wise, they'd fill up the neighboring storefronts in this revitalized little strip mall quickly.", "Date": "2014-05-31", "Author_Location": "Houston, TX"}, {"Author": "Shawna F.", "ReviewID": "EComhsGWV166t2GePnrXqQ", "Overall": "1.0", "Content": "Complete let down. I was so excited for this place to open, it's walking distance from my place.  We walk in and order a glass of wine, beer, sparkling water, the cheese plate and planned on getting another dish until we were served. First, the wine was terrible! $7 for tap wine, it was acidic and bitter. The beer tapped out and the guy served it anyway and said come back and I'll give you a free refill since this is all foam (more on this later). The cheese plate arrived, no bread. We asked and the counter guy said they're out of bread. Why would you not disclose this when we ordered? They served us soft cheese, really?  To spread on what? They ended up bringing some weird butter soaked pita. It was bad. We go back up to get that 'free' beer, he forgot, tried to charge and then when he was reminded, I kid you not, he poured half a glass and didn't blink an eye. All of this after we left him a 25% gratuity for counter service. Sorry Siphon, you have A LOT of kinks to work out.", "Date": "2014-06-23", "Author_Location": "Houston, TX"}, {"Author": "Stephen S.", "ReviewID": "u_93_QnXnoeEk6yCq4hG_g", "Overall": "2.0", "Content": "Amazing to me that the owner of Siphon has gone to such great lengths and expense to successfully complete this great space and then doesn't himself stay on the floor, behind the counter, or wherever need be, to make sure customer service is up to the standards of the décor, the drinks, the comfort, the music and the food.  It is all really great except for the service.  I did see the owner once, walking around with a laptop, completely oblivious to the \"cluster\" that was happening at the uber-trendy check out station.  I too have a business, and if any of my sales people can't say hello and goodbye to each and every person that comes in the door, then they can't work for me.  Try it.  It costs nothing.Good luck.", "Date": "2014-06-12", "Author_Location": "Houston, TX"}, {"Author": "Monica G.", "ReviewID": "OOEM0J-oC8Z_MgMVrs14uA", "Overall": "5.0", "Content": "This place is overpriced, which is the only thing I don't like.  The coffee is excellent, same source as Catalina Coffee, my previous favorite shop.  The range of coffees is vast with their signature Siphon brew.  The space itself is large and has varied sitting spots like stools, couches, outside seating, etc.  There's a spot for everyone.  I visited on a Sunday afternoon and there were plenty of seats when I entered and not a space left when I left.  So the word is definitely out on this one.Once again, really really good coffee.", "Date": "2014-06-01", "Author_Location": "New York, NY"}, {"Author": "Robert T.", "ReviewID": "Qu5lTaQrLpO8noN61yhsUQ", "Overall": "5.0", "Content": "Saw this place opened today so I had to check it out. I just had the breakfast tacos. Delicious!  Very cool atmosphere. Lot of great coffee shops in this area but this one is special. Try the siphon brew, very unique and oh so tasty!  Siphon will be my new coffee house. A must try.", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "Ron L.", "ReviewID": "diAoKoEo7aC9tw-t1u7L8A", "Overall": "2.0", "Content": "After reading about Siphon, I was looking forward to stopping by since it's on my way to work.  Counter staff was very friendly, so no complaints about the service.  I did, however, wait a decent chunk of time for an overpriced breakfast taco that was basically a large tortilla with about two tablespoons of filling.  The tortilla was great.  I think I saw a couple of chorizo crumbs somewhere in the filling.  The jasmine iced tea was good.  I might be back eventually, but I'll give it some time to find its roots.", "Date": "2014-07-01", "Author_Location": "Houston, TX"}, {"Author": "Wendy W.", "ReviewID": "J78gHlizM8z0OETWlH6ZWA", "Overall": "1.0", "Content": "Very disappointing experience.  2 hours after Siphon coffee opened I went in to try it.  I've been waiting for it to open.... I love good coffeehouses.  I wanted to give good business to the shop on its opening day so I purchased two breakfasts (even though I was by myself) and it's namesake coffee experience...The Siphon coffee for one.  I got my card and before the \"brewmaster\" got started, made sure to mention that I liked strong coffee, as I could see other siphon pots filled with a brew that looked more like tea.  The siphon brewmaster brushed me off with a \"Yeah, this is strong coffee\".  Ok, I sat down to wait and watch the process.  Unfortunately, I was quite disappointed with the coffee, and even more disappointed with the service.   I ended up purchasing an espresso adder so I would be able to enjoy my coffee experience.  I saw the manager circling the shop, but not once did he stop to inquire as to my experience until finally he needed the siphon pot back to serve other customers.  I seemed to interrupt him when I mentioned I would like to give feedback.  He then proceeded to shortly tell me the siphon coffee was not for me...contrary to my previous experience which informed me siphon coffee can be brewed to preference.  This made me want to immediately take back my 20% gratuity which I gave with purchase of my mediocre meal and poor tasting coffee.  Overall the only two positives about this experience were the location and ambience of the shop itself, and the very nice young man who was working the register and took my order.  Siphon coffee should hang on tight to this gentleman, as he truly was a gem.  As for the manager and the siphon brewmaster, several thumbs down.  I will not be back.", "Date": "2014-05-26", "Author_Location": "Houston, TX"}, {"Author": "Noah R.", "ReviewID": "JGjtloQgoGjSajfdWKLtHg", "Overall": "2.0", "Content": "I would really like this place, but the wifi doesn't work. It's bad enough to have to work on a day off. Now I have to sit here, finish this drink, which is good, then go somewhere else or go back to my kitchen table.", "Date": "2014-06-20", "Author_Location": "Houston, TX"}, {"Author": "Brianna D.", "ReviewID": "MT__c6td7BEGMLhdA8dSuQ", "Overall": "3.0", "Content": "I'm posting this because it's a pretty humorous and confusing experience.  I understand with new businesses, everything in the beginning is being fine tuned, hours are still being figured out, etc. However, Siphon's hours are posted on a giant sign facing Alabama Street and proclaim they open at 7am.  On their door, it says 8am. I rolled into the unlocked coffee shop a little after 8am on Saturday as well as another few people, and the guy who came from the back to greet us, announced they didn't open until 8am.  (Whaaaat???)  I checked my watch and looked at the door again, it was 8:05. The couple asked about the fact their yelp page states they open at 7am, he told her that yelp was inaccurate  and they wouldn't be open till 8am.  Again, the humor in it overrode being annoyed. I get they were clearly not ready to start serving people and raising frustration would not solve anything in that moment, but A. Don't unlock your door. 2.  Don't have two different opening times on your property 3. Perhaps check your own watch.  We all laughed it off after we were outside and noticed the guy inside, locked the door and stared at the hours sign for a few minutes before he walked away.  I know Siphon will be an amazing place. And based on all the reviews it's a place that's perfect for this area. And I understand new businesses are still figuring everything out, but this story has to be shared as advice on not committing to hours when the staff is clearly still figuring out what time they should open.", "Date": "2014-06-01", "Author_Location": "Houston, TX"}], "RestaurantInfo": {"RestaurantID": "VFJmhfwKMidnSiFFVCic_w", "Name": "Siphon Coffee", "Price": "$$", "RestaurantURL": "/biz/siphon-coffee-houston", "Longitude": " -95.388223", "Address": "701 W Alabama StHouston, TX 77006", "Latitude": " 29.738384", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/FItt0OsmSokLIKx1OHMakg/90s.jpg"}}