{"Reviews": [{"Author": "Jack", "ReviewID": "1234567890", "Overall": "5.0", "Content": "I was sitting at home watching movies with a friend when we were both hit by a craving for Chinese food. We quickly decided to order some delivery and, based on a variety of reasons (great online reviews, relatively close, not a huge minimum needed), decided to give Shanghai Inn a shot. Ordering was easy. Delivery was extremely quick, and the delivery guy was friendly and super nice. First, our appetizers. The crab rangoon were, in a word, awesome. They arrived piping hot and super crispy with a creamy and flavorful filling. The egg drop soup was also very good - not too salty, lots of egg, generally delicious. Unfortunately, our main courses just weren't good. My moo shu pork was...well...it was bad. The pancakes were the right thinness and consistency, but the sauce was super thick and gloopy and basically tasted like salt. The other problem was the lack of pork. My moo shu pork was very skimpy on the meat and was mostly vegetables, primarily cabbage. What little meat there was was incredibly chewy. It looks like my search for good moo shu will continue. My friend's chicken lo mein had a similar problem. Lots of noodles, mushrooms, peapods, a few water chestnuts, but almost no chicken. In fact, she found only two pieces of chicken in the entire container. She also complained about how salty it was, and she said that it was a bit too greasy.", "Date": "2015-02-01", "Author_Location": "Houston, TX"}, {"Author": "Tom", "ReviewID": "12345678901", "Overall": "5.0", "Content": "This was our last meal on our Chicago trip and we chose it after hearing great things about this place from our friend who used to live in the area. My husband and I came for an early dinner and the restaurant was pretty empty and quiet. We shared the following: - Avocado crostini: so tasty!! It's a delicious and light appetizer great for sharing! So fresh and delicious! Honestly, it's very simple and I could probably make this at home, but I had no regrets ordering it. Definitely recommend this one! - Lobster ravioli: I was pretty disappointed by this dish. It was a little on the bland side, and I wished it had more of a lemony citrusy flavor. - Pumpkin ravioli w/ butternut squash: delicious!!! I loved this dish. The flavor is amazing! It's seriously like autumn on a plate. Sweet, savory, and the sage is just perfection! One of the best pasta dishes I've ever had! - Panna cotta: this was definitely not your average panna cotta. It was actually a chocolate flavor which took me by surprise. They nailed the texture though! Overall, the panna cotta was good, but a little too rich for my personal liking. If you like desserts like decadent chocolate pudding, get this. Service was phenomenal! 5 stars for the service alone. The manager and server both took great care of us throughout the night. We felt like honorary guests! I would recommend this place just based on the amazing hospitality and service we received.", "Date": "2015-02-01", "Author_Location": "Houston, TX"}, {"Author": "Jack", "ReviewID": "123456789012", "Overall": "5.0", "Content": "My mouth is watering writing this review. Omg, these tacos are EVERYTHING and then some,imo. Los Tacos offers no tables to sit at, like more than half of the other spots at the market don't either. The line was composed of about 40 people when I got there, and the wait was probably about 10-15 minutes.... but the wait is extremely worth it. Their steak and pork tacos are fantastic. Their pico de gallo is tangy, but not over the top spicy. Holy crap. These are by far the fastest and tastiest tacos that have ever graced my mouth. Their pork tacos have freaking pineapple in them? I've never had this combo and I'm dying to have some more of them right now. The employees are really friendly and move efficiently fast. The price? about $3 dollars a taco. WHAT? yes. The tacos are made by a Mexican staff? YES! That's probably why they're so damn good. Something to keep in mind though, after you pay and receive your ticket, move quickly to the other side and give that other person your ticket. If you assume that after you pay, your ticket number or order will be called out for you to come get it, you will be waiting there for a longgggggg time.", "Date": "2015-02-01", "Author_Location": "Houston, TX"}, {"Author": "Jack", "ReviewID": "1234567890123", "Overall": "5.0", "Content": "In the basement of United Nations building, this restaurant feels like an upscale izakaya. We sat in a middle booth. We ordered draft Sapporo ($7) which came with 2 inches of foam and in a less than a pint size glass. The service was fairly slow but not unbearable once we got our full bottle of unfiltered shirakawago sake. The bottle was set on the table on ice in a beautiful wooden container with flower. We ordered: Sashimi: Tuna, amberjack, mackerel, red snapper, and salmon with iruka (instead of the uni) b/c [my dinner mates are not adventurous eaters]. Each piece was spectacularly thick and supple. The roe on the salmon was best I have ever eaten. It was sweet with a touch of brine instead of the other way around. A+ for presentation. Tuna Tartare with yellow and black masago on a bed of thinly sliced cucumbers. Roasted Duck slices served cold and wrapped around a bundle of soy marinated Daikon topped with a dot of pea sauce and half moon lemon slices. This dish is about contrast. The fatty and chewy meat plays excellently against salty crispy radish and the finish of citrus just brightens the bite. Chawamushi: Steam Egg custard with mushroom in a sour chicken broth. It had similar flavor profile to Cantonese hot n sour soup. It is a bit more asian than rest of our food order. We had chicken two ways. First was the jidori shioyaki. Crispy chicken skin. Grilled served with salt and miso.  Second was the tori-karaage which a fancy term for fried chicken. Five almost too big pieces of poultry. I am not sure why lofan people always leave the vegetal side. The lettuce with the fried chicken was less decadent. Beef. We had the signature ishiyaki which was thinly sliced beef slices cooked on top of a hot stone. (See the video). We also had the steak which paled in comparison. Finally NOODLES. Inaniwa Udon served hot in a clear broth. It was so refreshing eating just noodles, broth, and spinach. The noodles were Al dente and very slurp-able. The broth was light and fresh but had firm flavor.  This is what you should order. Dessert. Black sesame creme br?l¨¦e with black sesame ice cream.  Not so much burnt sugar but the Asian twist on this french dessert was rather delicious.", "Date": "2015-02-01", "Author_Location": "Houston, TX"}, {"Author": "Patricia S.", "ReviewID": "12345678901234", "Overall": "4.0", "Content": "I usually come here on friday or saturday nights with my friends, and its really crowded. Its a really cool atmosphere and we love coming here. Their pizzas and sweet potato fries are delicious! I love their food, its really good and theres a lot to choose from. Their desserts are definitely worth trying. Peach cobbler is a must!", "Date": "2014-06-18", "Author_Location": "Houston, TX"}], "RestaurantInfo": {"RestaurantID": "query", "Name": "query file", "Price": "$$", "RestaurantURL": "/", "Longitude": "-82.98598429999999", "Address": "Charlottesville, VA", "Latitude": "39.944412", "ImgURL": "/"}}